# 天乙贵人，有两种分法
tianyis =  {"甲":'未',  "乙":"申", "丙":"酉", "丁":"亥", "戊":'丑', "己":"子", 
            "庚": "丑", "辛":"寅", "壬": "卯", "癸":"巳"}

# 玉堂贵人，有两种分法
yutangs =  {"甲":'丑',  "乙":"子", "丙":"亥", "丁":"酉", "戊":'未', "己":"申", 
            "庚": "未", "辛":"午", "壬": "巳", "癸":"卯"}

# 天德贵人 
tiandes = {"子":"巳", "丑":"庚", "寅":"丁", "卯":"申", "辰":"壬", "巳":"辛", 
            "午":"亥", "未":"甲", "申":"癸", "酉":"寅", "戌":"丙", "亥":"乙"}

# 月德贵人
yuedes = {"子":"壬", "丑":"庚", "寅":"丙", "卯":"甲", "辰":"壬", "巳":"庚", 
              "午":"丙", "未":"甲", "申":"壬", "酉":"庚", "戌":"丙", "亥":"甲"}

# 孤辰
guchens  = {"子":"寅", "丑":"寅", "寅":"巳", "卯":"巳", "辰":"巳", "巳":"申", 
              "午":"申", "未":"申", "申":"亥", "酉":"亥", "戌":"亥", "亥":"寅"}
# 寡宿
guasus = {"子":"戌", "丑":"戌", "寅":"丑", "卯":"丑", "辰":"丑", "巳":"辰", 
              "午":"辰", "未":"辰", "申":"未", "酉":"未", "戌":"未", "亥":"戌"}

# 文昌
wenchangs = {"甲":'巳', "乙":"午", "丙":"申", "丁":"酉", "戊":"申", "己":"酉", 
            "庚": "亥", "辛":"子", "壬": "寅", "癸":"丑"}

# 阳刃
yangrens = {"甲":'卯', "乙":"辰", "丙":"午", "丁":"未", "戊":"午", "己":"未", 
            "庚": "酉", "辛":"戌", "壬": "子", "癸":"丑"}

# 飞刃
feirens = {"甲":'酉', "乙":"戌", "丙":"子", "丁":"丑", "戊":"子", "己":"丑", 
            "庚": "卯", "辛":"辰", "壬": "午", "癸":"未" }

# 红艳
hongyans = {"甲":'午', "乙":"午", "丙":"寅", "丁":"未", "戊":"辰", "己":"辰", 
            "庚": "戌", "辛":"酉", "壬": "子", "癸":"申"}
#将星
jiangxings = {"子":"子", "丑":"酉", "寅":"午", "卯":"卯", "辰":"子", "巳":"酉", 
              "午":"午", "未":"卯", "申":"子", "酉":"酉", "戌":"午", "亥":"卯"}

# 华盖
huagais = {"子":"辰", "丑":"丑", "寅":"戌", "卯":"未", "辰":"辰", "巳":"丑", 
              "午":"戌", "未":"未", "申":"辰", "酉":"丑", "戌":"戌", "亥":"未"}

# 驿马
yimas = {"子":"寅", "丑":"亥", "寅":"申", "卯":"巳", "辰":"寅", "巳":"亥", 
            "午":"申", "未":"巳", "申":"寅", "酉":"亥", "戌":"申", "亥":"巳"}
# 劫煞
jieshas = {"子":"巳", "丑":"寅", "寅":"亥", "卯":"申", "辰":"巳", "巳":"寅", 
         "午":"亥", "未":"申", "申":"巳", "酉":"寅", "戌":"亥", "亥":"申"}

# 亡神
wangshens = {"子":"亥", "丑":"申", "寅":"巳", "卯":"寅", "辰":"亥", "巳":"申", 
            "午":"巳", "未":"寅", "申":"亥", "酉":"申", "戌":"巳", "亥":"寅"}

# 桃花
taohuas =  {"子":"酉", "丑":"午", "寅":"卯", "卯":"子", "辰":"酉", "巳":"午", 
            "午":"卯", "未":"子", "申":"酉", "酉":"午", "戌":"卯", "亥":"子"}
# 天厨贵人
tianchus = {
    "甲": "巳", "乙": "午", "丙": "子", "丁": "巳", "戊": "午",
    "己": "申", "庚": "寅", "辛": "午", "壬": "酉", "癸": "亥"}

# 天医
tianyi = {
    "寅": "丑", "卯": "寅", "辰": "卯", "巳": "辰", "午": "巳", 
    "未": "午", "申": "未", "酉": "申", "戌": "酉", "亥": "戌", "子": "亥", "丑": "子"
}

# 卦气
guaqis = {
    "甲": "戌亥", "乙": "未申", "丙": "寅丑", "丁": "酉", "戊": "子",
    "己": "午", "庚": "卯", "辛": "辰巳", "壬": "戌亥", "癸": "未申"}

# 祿勋
luxuns = {"甲":"寅", "乙":"卯", "丙":"巳", "丁":"午", "戊":"巳", "己":"午", "庚":"申", "辛":"酉", "壬":"亥", "癸":"子"}  

# 国印
guoyins = {
    "甲": "戌", "乙": "亥", "丙": "丑", "丁": "寅",
    "戊": "丑", "己": "寅", "庚": "辰", "辛": "巳",
    "壬": "未", "癸": "申"
}

# 空亡
kongwangs = {
    ('甲', '子'): ('戌','亥'), ('乙', '丑'):('戌','亥'), 
    ('丙', '寅'): ('戌','亥'), ('丁', '卯'): ('戌','亥'), 
    ('戊', '辰'): ('戌','亥'), ('己', '巳'): ('戌','亥'),
    ('庚', '午'): ('戌','亥'), ('辛', '未'): ('戌','亥'),
    ('壬', '申'): ('戌','亥'), ('癸', '酉'): ('戌','亥'),

    ('甲', '戌'): ('申','酉'), ('乙', '亥'): ('申','酉'),
    ('丙', '子'): ('申','酉'), ('丁', '丑'): ('申','酉'),
    ('戊', '寅'): ('申','酉'), ('己', '卯'): ('申','酉'),
    ('庚', '辰'):('申','酉'), ('辛', '巳'): ('申','酉'),
    ('壬', '午'): ('申','酉'), ('癸', '未'): ('申','酉'),

    ('甲', '申'): ('午','未'), ('乙', '酉'): ('午','未'),
    ('丙', '戌'): ('午','未'), ('丁', '亥'): ('午','未'),
    ('戊', '子'): ('午','未'), ('己', '丑'): ('午','未'), 
    ('庚', '寅'): ('午','未'), ('辛', '卯'): ('午','未'),
    ('壬', '辰'): ('午','未'), ('癸', '巳'): ('午','未'),

    ('甲', '午'): ('辰','己'), ('乙', '未'): ('辰','己'),
    ('丙', '申'): ('辰','己'), ('丁', '酉'): ('辰','己'),
    ('戊', '戌'): ('辰','己'), ('己', '亥'): ('辰','己'),
    ('庚', '子'): ('辰','己'), ('辛', '丑'): ('辰','己'),
    ('壬', '寅'): ('辰','己'), ('癸', '卯'): ('辰','己'),

    ('甲', '辰'): ('寅','卯'), ('乙', '巳'): ('寅','卯'),
    ('丙', '午'): ('寅','卯'), ('丁', '未'): ('寅','卯'),
    ('戊', '申'): ('寅','卯'), ('己', '酉'): ('寅','卯'),
    ('庚', '戌'): ('寅','卯'), ('辛', '亥'): ('寅','卯'),
    ('壬', '子'): ('寅','卯'), ('癸', '丑'): ('寅','卯'), 


    ('甲', '寅'): ('子','丑'), ('乙', '卯'): ('子','丑'),     
    ('丙', '辰'): ('子','丑'), ('丁', '巳'): ('子','丑'), 
    ('戊', '午'): ('子','丑'), ('己', '未'): ('子','丑'),
    ('庚', '申'): ('子','丑'), ('辛', '酉'): ('子','丑'), 
    ('壬', '戌'): ('子','丑'), ('癸', '亥'): ('子','丑'),    
}

# 阴差阳错
yinchayangcuo_list = [
    ('丙', '子'), ('丙', '午'),  
    ('丁', '丑'), ('丁', '未'),  
    ('戊', '寅'), ('戊', '申'),  
    ('辛', '卯'), ('辛', '酉'),  
    ('壬', '辰'), ('壬', '戌'),  
    ('癸', '巳'), ('癸', '亥')   
]

# 金舆
jin_yu_dict = {"甲":"辰", "乙":"巳", "丙":"未", "丁":"申", "戊":"未", "己":"申", "庚":"戌", "辛":"亥", "壬":"丑", "癸":"寅"}

# 红鸾
hongluan_dict = {
    "子": "卯", "丑": "寅", "寅": "丑", "卯": "子", 
    "辰": "亥", "巳": "戌", "午": "酉", "未": "申", 
    "申": "未", "酉": "午", "戌": "巳", "亥": "辰"
}

# 天喜
tianxi_dict = {
    "子": "酉", "丑": "申", "寅": "未", "卯": "午", 
    "辰": "巳", "巳": "辰", "午": "卯", "未": "寅", 
    "申": "丑", "酉": "子", "戌": "亥", "亥": "戌"
}

# 丧门字典（年支前两位地支）
sangmen_dict = {
    "子": "寅", "丑": "卯", "寅": "辰", "卯": "巳",
    "辰": "午", "巳": "未", "午": "申", "未": "酉",
    "申": "戌", "酉": "亥", "戌": "子", "亥": "丑"
}

# 吊客字典（年支后两位地支）
diaoke_dict = {
    "子": "戌", "丑": "亥", "寅": "子", "卯": "丑",
    "辰": "寅", "巳": "卯", "午": "辰", "未": "巳",
    "申": "午", "酉": "未", "戌": "申", "亥": "酉"
}

# 大耗字典（年支对冲地支）
dahao_dict = {
    "子": "午", "丑": "未", "寅": "申", "卯": "酉",
    "辰": "戌", "巳": "亥", "午": "子", "未": "丑",
    "申": "寅", "酉": "卯", "戌": "辰", "亥": "巳"
}

# 小耗字典（大耗前一位地支）
xiaohao_dict = {
    "子": "未", "丑": "申", "寅": "酉", "卯": "戌",
    "辰": "亥", "巳": "子", "午": "丑", "未": "寅",
    "申": "卯", "酉": "辰", "戌": "巳", "亥": "午"
}

# 病符/蓦越字典（年支退一位）
bingfu_dict = {
    "子": "亥", "丑": "子", "寅": "丑", "卯": "寅",
    "辰": "卯", "巳": "辰", "午": "巳", "未": "午",
    "申": "未", "酉": "申", "戌": "酉", "亥": "戌"
}

# 死符字典（病符对冲位）
sifu_dict = {
    "子": "巳", "丑": "午", "寅": "未", "卯": "申",
    "辰": "酉", "巳": "戌", "午": "亥", "未": "子",
    "申": "丑", "酉": "寅", "戌": "卯", "亥": "辰"
}

# 官符字典（年支顺四位）
guanfu_dict = {
    "子": "辰", "丑": "巳", "寅": "午", "卯": "未",
    "辰": "申", "巳": "酉", "午": "戌", "未": "亥",
    "申": "子", "酉": "丑", "戌": "寅", "亥": "卯"
}

# 旌钺煞  只有时见算
jingyue_dict = {
    "寅": "寅", "午": "寅", "戌": "寅",  # 寅午戌年生人见寅时
    "亥": "亥", "卯": "亥", "未": "亥",  # 亥卯未年生人见亥时
    "申": "申", "子": "申", "辰": "申",  # 申子辰年生人见申时
    "巳": "巳", "酉": "巳", "丑": "巳"   # 巳酉丑年生人见巳时
}

# 旌德煞 只有日时
jingde_year_dict = {
    "寅": "丙", "午": "丙", "戌": "丙",  
    "亥": "甲", "卯": "甲", "未": "甲",  
    "申": "壬", "子": "壬", "辰": "壬",  
    "巳": "庚", "酉": "庚", "丑": "庚"   
}

# 血支年支对应固定地支
xuezhi_dict = {
    "子": "戌", "丑": "酉", "寅": "申", "卯": "未",
    "辰": "午", "巳": "巳", "午": "辰", "未": "卯",
    "申": "寅", "酉": "丑", "戌": "子", "亥": "亥"
}

# 血刃查法：月支对应固定地支
xueren_dict = {
    "寅": "丑", "卯": "未", "辰": "寅", "巳": "申",
    "午": "卯", "未": "酉", "申": "辰", "酉": "戌",
    "戌": "巳", "亥": "亥", "子": "午", "丑": "子"
}

# 流霞查法：日干对应固定地支
liuxia_dict = {
    "甲": "酉", "乙": "戌", "丙": "未", "丁": "申",
    "戊": "巳", "己": "午", "庚": "辰", "辛": "卯",
    "壬": "亥", "癸": "寅"
}

# 福星贵人
fuxing_dict = {
    "甲": "寅",  # 甲日见寅
    "乙": "丑",  # 乙日见丑
    "丙": "子",  # 丙日见子
    "丁": "酉",  # 丁日见酉
    "戊": "申",  # 戊日见申
    "己": "未",  # 己日见未
    "庚": "午",  # 庚日见午
    "辛": "巳",  # 辛日见巳
    "壬": "辰",  # 壬日见辰
    "癸": "卯"   # 癸日见卯
}

# 自缢煞字典（年支/日支对应关系）
ziyi_dict = {
    "戌": "巳", "巳": "戌", "辰": "亥", "亥": "辰",
    "寅": "未", "未": "寅", "卯": "申", "申": "卯",
    "午": "丑", "丑": "午", "子": "酉", "酉": "子"
}


# 剑锋煞/岁驾字典（只有太岁的地支是，见吉则吉，见凶则凶）
suijia_dict = {
    "戌": "戌", "巳": "巳", "辰": "辰", "亥": "亥",
    "寅": "寅", "未": "未", "卯": "卯", "申": "申",
    "午": "午", "丑": "丑", "子": "子", "酉": "酉"
}

# 天空/青龙 （太岁起）
tiankong_dict = {
    # 太岁前一位即天空（子→丑，丑→寅，循环至亥→子）
    "子": "丑", "丑": "寅", "寅": "卯", "卯": "辰",
    "辰": "巳", "巳": "午", "午": "未", "未": "申",
    "申": "酉", "酉": "戌", "戌": "亥", "亥": "子"
}

# 天厄 天空对位
tiane_dict = {
    "子": "未", "丑": "申", "寅": "酉", "卯": "戌",
    "辰": "亥", "巳": "子", "午": "丑", "未": "寅",
    "申": "卯", "酉": "辰", "戌": "巳", "亥": "午"
}

# 勾煞：命前三辰（向前数3位）
gou_dict = {
    "子": "酉", "丑": "戌", "寅": "亥", "卯": "子",
    "辰": "丑", "巳": "寅", "午": "卯", "未": "辰",
    "申": "巳", "酉": "午", "戌": "未", "亥": "申"
}

# 绞煞：命后三辰（向后数3位）
jiao_dict = {
    "子": "卯", "丑": "辰", "寅": "巳", "卯": "午",
    "辰": "未", "巳": "申", "午": "酉", "未": "戌",
    "申": "亥", "酉": "子", "戌": "丑", "亥": "寅"
}